package ru.nik66.practice1;
/**
 Практическое задание 1 - примитивы, классы, методы, поля, управляющие конструкции.
 1) Создайте класс, в котором присутствуют переменные класса всех примитивных типов. Выведите на экран значение полей класса бе предварительной инициализации.
 Повторите то же самое для локальных переменных.
 2) Создайте несколько переменных типа float. Присвойте этим переменным значения:
 1.;
 1;
 0x1;
 0b1;
 1.0e1;
 01;
 3) Создайте переменную типа short. Инициализируйте ее результатом выполнения следующих операций:
 - суммой двух целых чисел;
 - суммой целого и дробного числа;
 - суммой значений переменных типов float и int;
 - суммой значений переменных типа byte + short;
 - суммой значений переменных типа float + double;
 4) Заданы значения 2-х катетов и гипотенузы треугольника. Проверить является ли данный треугольник прямоугольным. Вычисления записать выражением, состоящим из одной строки (испольуя оператор "?:").
 5) Подсчитать сумму целых чисел от 1 до 20.
 6) Подсчитать сумму четных целых чисел от 1 до 20.
 7) Подсчитать сумму простых чисел в диапазоне от 1 до 20.
 8) Имея три переменные типа int a, b, c выведите на экран true, если сумма значений двух любых из этих переменных равна значению третей.
 9) Две переменные типа int, имеют положительные значения int a - начало диапазона, int b - конец диапазона, a>b. Вычислить среднее значение чисел в заданном диапазоне.
 Для решения заданий 5-9 используйте различные циклы (for/while/do-while).
 10) Написать программу расчета обяательных платежей кредита при польовании банковским кредитом.
 Задание:
 а) Для каждого месяца ввывести на экран сумму к оплате по телу кредита и начисленные проценты.
 б) Суммарное значение выплаченных процентов за период пользования кредитом.
 Исходные данные: Сумма кредита, процентная ставка, срок кредитования.
 */
