package ru.nik66.practice2;
/**
 * Уровень сложности: простой
 * 1. Заданы 2 произвольных строки. Из этих строк создать одну объединенную без первых
 * символов в каждой из строк.
 * 2. Задана строка с нечетным количеством символов. Сооздайте строку, состоящую из 3-х
 * символов, например: "Candy" -> "and", "solving" -> "lvi".
 * 3. Задана строка произвольного размера. Создайте из этой строки новую, в которой 2
 * последних символа исходной строки перенесены в начало.
 *
 * Уровень сложности: средний
 * 4. Из заданной строки составьте новую, в которой каждый исходный символ представлен
 * двумя, например: "Candy" -> "CCaannddyy".
 * 5. Найдите все вхождения строки "b*b" (* - любой символ) в заданной строке без
 * использования регулярных выражений, например "bob is bab" -> 2.
 * 6. Создайте подстроку из исходной строки, где в каждом слове, содержащем символ "*"
 * удалены соседние левый и правый символы, например "th*is is sum*mer" -> "ts is suer".
 *
 * Уровень сложности: средний+
 * 7. В заданной строке подсчитайте количество слов, заканчивающихся на 'a' или 's', без
 * учета регистра символов.
 * 8. Заданы две строки. Создайте новую строку, состоящую из первой строки, в которой
 * удалены все вхождения второй строки.
 *
 * Домашнее задание
 * Реализовать программу учета среднесуточной темперауры на протяжении месяца. Ввод данных
 * реализовать с консоли. Вначале должен быть выведен запрос названия месяца, затем значений
 * температуры для каждого числа. Количество дней в месяце программа должна определять
 * автоматически. Значения хранить в ArrayList. При вводе реализовать проверку корректности
 * вводимых данных, если данные введены не корректно - запросить ввод повторно. После
 * введения данных вывести среднемесячную температуру, дату когда была максимальная
 * температура и минимальная с указанием ее значения.
 */
